Catalogs/DiscountsMarkupsProvidingConditions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>DiscountsMarkupsProvidingConditions</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AssignmentCondition</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DiscountsMarkupsProvidingConditions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseRestrictionCriterionForSalesVolume</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DiscountMarkupUseLimitCriteriaForSalesVolume</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RestrictionArea</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DiscountMarkupRestrictionAreasVariants</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RestrictionConditionValue</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RestrictionCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ComparisonType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DiscountMarkupValuesComparisonTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TakeIntoAccountSaleOfOnlyParticularProductsAndServicesList</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Comment>Any additional information</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>PurchaseKit</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ProductsAndServices</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServices</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Characteristic</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServicesCharacteristics</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MeasurementUnit</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.UOMClassifier</v8:Type>
								<v8:Type>cfg:CatalogRef.UOM</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>SalesFilterByProductsAndServices</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ProductsAndServices</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServices</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Characteristic</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServicesCharacteristics</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/DiscountsMarkupsProvidingConditions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>DiscountsMarkupsProvidingConditions</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ForOneTimeSalesVolume</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ForKitPurchase</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/DiscountMarkupUseLimitCriteriaForSalesVolume.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>DiscountMarkupUseLimitCriteriaForSalesVolume</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Amount</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Quantity</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/DiscountsMarkupsProvidingConditions/Ext/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventsHandlers

// Procedure - FillCheckProcessing event handler.
//
Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	UsedCurrencies = GetFunctionalOption("CurrencyTransactionsAccounting");
	
	If AssignmentCondition = Enums.DiscountsMarkupsProvidingConditions.ForOneTimeSalesVolume Then
		
		CheckedAttributes.Clear();
		CheckedAttributes.Add("RestrictionArea");
		CheckedAttributes.Add("UseRestrictionCriterionForSalesVolume");
		CheckedAttributes.Add("ComparisonType");
		If  UseRestrictionCriterionForSalesVolume = Enums.DiscountMarkupUseLimitCriteriaForSalesVolume.Amount 
			AND UsedCurrencies 
		Then
			CheckedAttributes.Add("RestrictionCurrency");
		EndIf;
		
	ElsIf AssignmentCondition = Enums.DiscountsMarkupsProvidingConditions.ForKitPurchase Then
		
		CheckedAttributes.Clear();
		CheckedAttributes.Add("PurchaseKit");
		CheckedAttributes.Add("PurchaseKit.ProductsAndServices");
		CheckedAttributes.Add("PurchaseKit.PackingsQuantity");
		CheckedAttributes.Add("PurchaseKit.Quantity");
		//TabularSectionDataProcessorProductsServer.CheckCharacteristicsFilling(ThisObject, New Array, Cancel, New Structure("TSName","PurchaseKit"));	
		
	EndIf;
	
	CheckedAttributes.Add("Description");
	CheckedAttributes.Add("AssignmentCondition");
	
EndProcedure

// Procedure - BeforeWrite event handler.
//
Procedure BeforeWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If Not IsFolder Then
		TakeIntoAccountSaleOfOnlyParticularProductsAndServicesList = AssignmentCondition = Enums.DiscountsMarkupsProvidingConditions.ForOneTimeSalesVolume AND 
																(SalesFilterByProductsAndServices.Count() > 0);
															EndIf;
	
	If AssignmentCondition = Enums.DiscountsMarkupsProvidingConditions.ForKitPurchase Then
		SalesFilterByProductsAndServices.Clear();
	ElsIf AssignmentCondition = Enums.DiscountsMarkupsProvidingConditions.ForOneTimeSalesVolume Then
		PurchaseKit.Clear();
	EndIf;
	
EndProcedure

// Procedure - FillingProcessor event handler.
//
Procedure Filling(FillingData, StandardProcessing)
	
	If Not IsFolder Then
		RestrictionCurrency = Constants.AccountingCurrency.Get();
	EndIf;
	
EndProcedure

#EndRegion

#EndIf
